final String tableInfo = 'info'; // назва таблиці

class InfoFields { //назва усіх стовбиців у типі String
  static final List<String> values = [
    /// Add all fields
    id, isImportant, clas, description, infection, symptoms, prevention
  ];

  static final String id = '_id';
  static final String isImportant = 'isImportant';
  static final String clas = 'clas';
  static final String description = 'description';
  static final String infection = 'infection';
  static final String symptoms = 'symptoms';
  static final String prevention = 'prevention';
}


class Info { // клас із даними та їх обробкою
  final int? id;
  final bool isImportant;
  final String clas;
  final String description;
  final String infection;
  final String symptoms;
  final String prevention;

  const Info({
    this.id,
    required this.isImportant,
    required this.clas,
    required this.description,
    required this.infection,
    required this.symptoms,
    required this.prevention,
  });

  // копіювання
  Info copy({
    int? id,
    bool? isImportant,
    String? clas,
    String? description,
    String? infection,
    String? symptoms,
    String? prevention,
  }) =>
      Info(
        id: id ?? this.id,
        isImportant: isImportant ?? this.isImportant,
        clas: clas ?? this.clas,
        description: description ?? this.description,
        infection: infection ?? this.infection,
        symptoms: symptoms ?? this.symptoms,
        prevention: prevention ?? this.prevention,
      );

  // перевод з типу JSON у інші типи
  static Info fromJson(Map<String, Object?> json) => Info(
    id: json[InfoFields.id] as int?,
    isImportant: json[InfoFields.isImportant] == 1,
    clas: json[InfoFields.clas] as String,
    description: json[InfoFields.description] as String,
    infection: json[InfoFields.infection] as String,
    symptoms: json[InfoFields.symptoms] as String,
    prevention: json[InfoFields.prevention] as String,
  );

  // перевод з інших типів у JSON
  Map<String, Object?> toJson() => {
    InfoFields.id: id,
    InfoFields.isImportant: isImportant ? 1 : 0,
    InfoFields.clas: clas,
    InfoFields.description: description,
    InfoFields.infection: infection,
    InfoFields.symptoms: symptoms,
    InfoFields.prevention: prevention,
  };
}

List<Info> infos = [
  const Info(id: 0,
      clas: "tomatoHealthy",
      description: "Здорова рослина томату.",
      infection: "Відсутня",
      symptoms: "Відсутня",
      prevention: "Відсутня",
      isImportant: false),

  const Info(id: 1,
      clas: "tomatoBacterialSpot",
      description: "Плямистість бактеріальна чорна є бактеріальною хворобою, спричиненою бактерією Xanthomonas versicatoria. Вона впливає на рослини томатів, особливо на листя та плоди. Хвороба може призводити до серйозного ураження рослин та значного зниження врожайності.",
      infection: "Бактерія Xanthomonas versicatoria може проникати в рослини томатів через мікропори або пошкодження на листках, стеблах або плодах. Інфекція може відбуватися через дощ, вітер, шкідників або заражені інструменти.",
      symptoms: "Першими ознаками хвороби є поява малих, водянистих, жовтуватих плям на листках. Ці плями з часом стають овальними або круглими, розміром до 1 см. Пізніше, плями темніють і оточуються жовтуватою областю. На плодах також можуть з'являтися чорні, водянисті плями з нерівними краями. У вологу погоду, плями можуть вкривати значну частину листя, спричиняючи його опалення та висихання.",
      prevention: "Вирощуйте сорти томатів, які мають вбудовану стійкість до плямистості бактеріальної чорної."+
          "Збирайте і знищуйте заражені рослини, включаючи уражені листя та плоди."+
          "Уникайте вологого середовища, що сприяє поширенню бактерії. Добре провітрюйте рослини та уникайте зайвого зволоження."+
          "Уникайте повторного використання зараженого насіння."+
          "Дезінфікуйте садовий інструмент перед використанням."+
          "обробляти уражені рослини бордоської рідиною."+
          "перед посівом замочувати насіння в іммуноцітофіті",
      isImportant: false),

  const Info(id: 2,
      clas: "tomatoLeafMold",
      description: "Наукова назва листової цвілі – кладоспоріоз. У народі це захворювання ще називають бурою плямистістю. Зазвичай хвороба вражає томати, вирощувані в закритому ґрунті. Для вирощуваних на відкритій грядці рослин хвороба не є небезпечною, оскільки температура недостатня для її поширення.",
      infection: "Кладоспоріоз провокує грибок Cladosporium fulvum Cooke. У неактивному стані життєздатність спор зберігається протягом 12 місяців. При цьому колонія стійко переносить зниження температури і тривале перебування без доступу вологи. Грибок здатний замовити в ґрунті без доступу до рослинних залишків. З настанням весни збудник захворювання знову перебирається на помідори.",
      symptoms: "Бура плямистість на томатах проявляється жовтими плямами на верхній стороні листя й сіро-коричневим нальотом, іноді з фіолетовим відтінком, на нижній. При сильному ураженні наліт утворюється також і на поверхні листя. Із розвитком захворювання листя стає коричневим, в'яне, але не опадає.",
      prevention: "1.	Обробка фунгіцидами: Застосування фунгіцидних препаратів може бути ефективним засобом контролю листової цвілі. Дотримуйтесь інструкцій на упаковці і застосовуйте їх згідно з рекомендаціями."+
          "\n2.	Вибір сортів: Обирайте сорти томатів, які відомі своєю стійкістю до листової цвілі. Існують сорти, які мають природну стійкість до цього захворювання."+
          "\n3.	Добре провітрювання: Розташовуйте рослини томатів на відстані, що сприяє хорошому провітрюванню між ними. Це допоможе знизити вологість і запобігти утворенню сприятливих умов для розвитку листової цвілі.",
      isImportant: false),

  const Info(id: 3,
      clas: "tomatoSeptoriaLeafSpot",
      description: "Септоріоз є грибковим захворюванням, спричиненим грибом Septoria lycopersici. Воно поширене серед помідорів, а також може впливати на картоплю, баклажани та чорний паслін. Хвороба переважно пошкоджує листки рослин, а також може впливати на стебла та плоди.",
      infection: "Гриб Septoria lycopersici здатний інфікувати рослини помідорів, починаючи з сіянців і розсади. Інфекція поширюється через повітряні краплі, дощ, шкідників та заражені рослинні залишки.",
      symptoms: "Перші ознаки хвороби з'являються на молодих листках і розсаді помідорів у вигляді брудно-білих плям з темним обідком та численними темними крапками, що містять спори гриба. З часом плями зливаються і покривають усю поверхню листків. Листя жовтіє, в'яне і опадає, що призводить до значного зниження врожайності.",
      prevention: "Запобігання захворюванню: "+
          "Використовуйте стійкі і імунованні сорти помідорів та гібридні форми рослин, на яких хвороботворні плями на листах куща з'являються дуже маленькі."+""
          "Видаляйте бур'яни та рослинні залишки, щоб знизити наявність грибкових спор."+
          "Дотримуйтесь правильної агротехніки, включаючи сівозміну та виконання відповідних заходів профілактики.",
      isImportant: false),

  const Info(id: 4,
      clas: "tomatoSpiderMitesTwoSpottedSpiderMite",
      description: "Павутинні кліщі – це комашки дуже малого розміру (від 1мм до 2мм), що плетуть павутинки, висмоктують соки у рослин. Вони можуть бути різного кольору: жовто-зелені, червоні, оранжеві, білі. На початку зараження, павутинні кліщі знаходяться на нижній частині листків - це малесенькі крапочки, що рухаються. ",
      infection: "Листочки, уражені павутинним кліщем, змінюють колір, з’являються жовті крапочки, і листки завчасно опадають, далі кліщики переносяться на всю рослину, і вона втрачає вигляд та гине.",
      symptoms: "При ураженні павутинними кліщами рослина покривається павутиною.",
      prevention: "Щоденно обприскуйте рослини, щоб запобігти появі павутинного кліща."+
          "Якщо шкідники вже з'явилися, ізолюйте рослину, помістивши її в прохолодне місце, і використовуйте хімічні препарати, такі як акарициди або інсектоакарициди, для обробки рослин. Рекомендується провести обробку двічі, якщо це необхідно.",
      isImportant: false),

  const Info(id: 5,
      clas: "tomatoLateBlight",
      description: "Фітофтороз є серйозним захворюванням рослин, спричиненим грибком Phytophthora. Він атакує різні види рослин, зокрема картоплю, помідори, огірки, виноград та декоративні рослини. Хвороба може призвести до виснаження рослин, зниження врожайності та навіть загибелі.",
      infection: "Грибок Phytophthora може проникнути до рослин через вологу середовище, особливо під час дощів або надмірного зволоження ґрунту. Він може також передаватися через інфіковані насіння, рослинні залишки або спори грибка у ґрунті. Розповсюдження грибка сприяють також шкідники, які можуть бути носіями хвороби",
      symptoms: "Симптоми: Симптоми фітофторозу можуть залежати від виду рослини, але загальні ознаки включають:"+
          "\n1.	Зниження зеленості та в'янення листків."+
          "\n2.	Поява плям на листках, які можуть бути жовтуватими, коричневими або чорними."+
          "\n3.	Загнивання кореневої системи та стебел."+
          "\n4.	Зміна текстури та коліру плодів, включаючи зміну кольору, м'якість та появу гнилі.",
      prevention: "Запобігання захворюванню:"+
          "\n1.	Вирощуйте сорти рослин, які мають вбудовану стійкість до фітофторозу."+
          "\n2.	Забезпечуйте добру дренаж та уникайте надмірного зволоження ґрунту."+
          "\n3.	Уникайте повторного використання заражених насіння або рослинних залишків."+
          "\n4.	Дотримуйтесь правильного повороту культур."+
          "\n5.	Використовуйте фунгіциди або біологічні засоби захисту рослин при необхідності.",
      isImportant: false),

  const Info(id: 6,
      clas: "tomatoEarlyblight",
      description: "Альтернаріоз (Alternaria solani) ",
      infection: "Гриб A. solani може перезимовувати на заражених рештках рослин, на ґрунті та уражених бадиллях. Весною, під час активної споруляції, спори гриба поширюються повітрям і осідають на листках картоплі. При сприятливих умовах, таких як тепла погода та вологість, конідії гриба проростають на листках та проникають в тканини рослин.",
      symptoms: "На ранніх стадіях зараження на листках з'являються плями жовтого або коричневого кольору з темним нальотом. Ці плями зазвичай мають круглу або овальну форму і можуть зливатися разом. При продовженому розвитку хвороби, плями збільшуються у розмірах, стають буруватими з вираженою концентричною зональністю. На стеблах і черешках листя формуються продовгуваті темно-бурі плями з чорним або темно-сірим нальотом. При сильному ураженні, стебла можуть в'янути, а на поверхні бульб утворюються темно-коричневі або чорні плями.",
      prevention: "Використовуйте здорові насіннєвий матеріал.\n Проводьте ротацію культур, уникайте посадки картоплі на тому ж місці протягом кількох років.Збирайте і знищуйте заражені рештки рослин та уражені бульби.Забезпечуйте відповідну вентиляцію та освітлення рослин.Оберіть сорти картоплі, які більш стійкі до захворювань.Використовуйте фунгіцидні препарати для захисту рослин від грибкових захворювань, дотримуючись інструкцій і дозувань.",
      isImportant: false),

  const Info(id: 7,
      clas: "tomatoMosaicVirus",
      description: "Небезпечна хвороба томатів, що вирощуються в теплицях, а також ранніх, а іноді й пізніх сортів, що вирощуються у відкритому ґрунті. Особливо сильно уражаються сорти індетермінантного типу, вирощені з розсади, оскільки багато агротехнічних заходів сприяють механічному перенесенню збудника.",
      infection: "Мозаїка на томатах спричиняється вірусом, який належить до групи Tobamovirus. Основний представник цієї групи - вірус тютюнової мозаїки (TMV). Вірус мозаїки томатів (ToMV) є окремим вірусом, який має високу термостійкість і зберігає патогенність на тривалому періоді. Цей вірус може виявлятися в рослинах навіть у низьких концентраціях. Деякі сорти тютюну та види рослин можуть проявляти локальні некротичні ознаки при зараженні вірусом мозаїки томатів. Присутність вірусу мозаїки томатів разом з вірусом картопляної мозаїки X може посилити симптоми хвороби.",
      symptoms: "Листова пластинка деформується і стає папоротеподібною. На ній з'являються ниткоподібні ділянки і вирости тканини знизу. У плодах появляються сіро-зелені ділянки, які перетворюються на некротичні. Пучки тканини некротизуються і утворюють коричневу сіточку. Мозаїка на рослині може мати різне забарвлення, з чітким чергуванням тканин. Листова пластинка росте нерівномірно, а ознаки найбільш помітні на верхніх листках.",
      prevention:
      "1.	Використовуйте здорові насіння томатів. Переконайтеся, що насіння не заражене вірусом мозаїки томатів перед посівом."+
          "\n2.	Дотримуйтесь належної санітарії в городі. Видаліть і знищте хворі рослини або їх уражені частини, щоб запобігти поширенню вірусу."+
          "\n3.	Зберігайте фізичну відстань між здоровими і хворими рослинами, а також уникайте переносу вірусу через інструменти, рукавички або руки."+
          "\n4.	Розгляньте використання сортів томатів, які мають стійкість до вірусу мозаїки томатів. Деякі сорти томатів мають природну стійкість до цього вірусу, що зменшує ризик зараження."+
          "\n5.	Застосовуйте правильний агротехнічний догляд за томатами, включаючи регулярний полив, добре дреновані ґрунти та дотримання оптимальних умов вирощування. Сильні, здорові рослини мають більшу стійкість до захворювань."+
          "\n6.	Враховуйте використання хімічних засобів контролю. У деяких випадках може бути необхідне використання фунгіцидів або інших хімічних препаратів для контролю за захворюванням.",
      isImportant: false),

  const Info(id: 8,
      clas: "tomatoYellowLeafCurlVirus",
      description: "Збудник жовтої кучерявості листя томатів – Tomato yellow leaf curl virus переноситься білокрилками, батьки яких заразилися за два тижні до цього.",
      infection: "Найчастіше вірус жовтої кучерявості уражує рослини, які вирощуються в умовах закритого ґрунту, адже підвищена вологість повітря і тепло створюють ідеальне середовище для розвитку патогенних мікроорганізмів. Вірус зазвичай переноситься білокрилками. Механізм такий: харчуючись на хворому кущі як мінімум два тижні, інфекцію отримує нове покоління комах, яке вилуплюється з відкладених яєць.",
      symptoms: "Цей вірус найбільше шкодить рослинам на ранній стадії розвитку, зупиняючи їх ріст та зав'язування плодів. У дорослих рослин плоди можуть дозрівати візуально нормальними, але з часом починається часткове опадання квітконосів, а плоди стають дрібними, твердими та ребристими. Першою ознакою зараження є хлоротичне пожовтіння стебел. Листя змінює забарвлення лише по краях, а середина залишається темно-зеленою. Тканини між прожилками листка зморшкуються і поступово втрачають колір. Листя стає меншим і скручується, набуваючи чашоподібної форми, що призводить до \"кучерявості\" верхівки рослини.",
      prevention: "1. Для захисту від білокрилок мінімізують можливості потрапляння шкідників у теплицю."+
          "\n2.Заражені рослини видаляють у захисному одязі. Одяг дезінфікують а заражені рослини спалюють подалі від теплиць."+
          "\n3.Решту рослин обробляють бордоською рідиною або мідним купоросом.",
      isImportant: false),

  const Info(id: 9,
      clas: "pepperBellBacterialSpot",
      description: "Плямистість бактеріальна чорна є бактеріальною хворобою, спричиненою бактерією Xanthomonas versicatoria. Вона впливає на болгарський перець, особливо на листя та плоди. Хвороба може призводити до серйозного ураження рослини та значного зниження врожайності.",
      infection: "Бактерія Xanthomonas versicatoria може проникати в рослині через мікропори або пошкодження на листках, стеблах або плодах. Інфекція може відбуватися через дощ, вітер, шкідників або заражені інструменти.",
      symptoms: "Першими ознаками хвороби є поява малих, водянистих, жовтуватих плям на листках. Ці плями з часом стають овальними або круглими, розміром до 1 см. Пізніше, плями темніють і оточуються жовтуватою областю. На плодах також можуть з'являтися чорні, водянисті плями з нерівними краями. У вологу погоду, плями можуть вкривати значну частину листя, спричиняючи його опалення та висихання.",
      prevention: "Вирощуйте сорти болгарських перців, які мають вбудовану стійкість до плямистості бактеріальної чорної."+
          "Збирайте і знищуйте заражені рослини, включаючи уражені листя та плоди."+
          "Уникайте вологого середовища, що сприяє поширенню бактерії. Добре провітрюйте рослини та уникайте зайвого зволоження."+
          "Уникайте повторного використання зараженого насіння."+
          "Дезінфікуйте садовий інструмент перед використанням."+
          "обробляти уражені рослини бордоської рідиною."+
          "перед посівом замочувати насіння в іммуноцітофіті",
      isImportant: false),

  const Info(id: 10,
      clas: "pepperHealthy",
      description: "Здорова рослина болгарського перцю.",
      infection: "Відсутня",
      symptoms: "🌱Зелений та сильний🌱",
      prevention: "Відсутня",
      isImportant: false),

  const Info(id: 11,
      clas: "potatoEarlyblight",
      description: "Альтернаріоз (Alternaria solani) ",
      infection: "Гриб A. solani може перезимовувати на заражених рештках рослин, на ґрунті та уражених бадиллях. Весною, під час активної споруляції, спори гриба поширюються повітрям і осідають на листках картоплі. При сприятливих умовах, таких як тепла погода та вологість, конідії гриба проростають на листках та проникають в тканини рослин.",
      symptoms: "На ранніх стадіях зараження на листках з'являються плями жовтого або коричневого кольору з темним нальотом. Ці плями зазвичай мають круглу або овальну форму і можуть зливатися разом. При продовженому розвитку хвороби, плями збільшуються у розмірах, стають буруватими з вираженою концентричною зональністю. На стеблах і черешках листя формуються продовгуваті темно-бурі плями з чорним або темно-сірим нальотом. При сильному ураженні, стебла можуть в'янути, а на поверхні бульб утворюються темно-коричневі або чорні плями.",
      prevention: "Використовуйте здорові насіннєвий матеріал.\n Проводьте ротацію культур, уникайте посадки картоплі на тому ж місці протягом кількох років.Збирайте і знищуйте заражені рештки рослин та уражені бульби.Забезпечуйте відповідну вентиляцію та освітлення рослин.Оберіть сорти картоплі, які більш стійкі до захворювань.Використовуйте фунгіцидні препарати для захисту рослин від грибкових захворювань, дотримуючись інструкцій і дозувань.",
      isImportant: false),

  const Info(id: 12,
      clas: "potatoLateBlight",
      description: "Фітофтороз є серйозним захворюванням рослин, спричиненим грибком Phytophthora. Він атакує різні види рослин, зокрема картоплю, помідори, огірки, виноград та декоративні рослини. Хвороба може призвести до виснаження рослин, зниження врожайності та навіть загибелі.",
      infection: "Грибок Phytophthora може проникнути до рослин через вологу середовище, особливо під час дощів або надмірного зволоження ґрунту. Він може також передаватися через інфіковані насіння, рослинні залишки або спори грибка у ґрунті. Розповсюдження грибка сприяють також шкідники, які можуть бути носіями хвороби",
      symptoms: "Симптоми: Симптоми фітофторозу можуть залежати від виду рослини, але загальні ознаки включають:"+
          "\n1.	Зниження зеленості та в'янення листків."+
          "\n2.	Поява плям на листках, які можуть бути жовтуватими, коричневими або чорними."+
          "\n3.	Загнивання кореневої системи та стебел."+
          "\n4.	Зміна текстури та коліру плодів, включаючи зміну кольору, м'якість та появу гнилі.",
      prevention: "Запобігання захворюванню:"+
          "\n1.	Вирощуйте сорти рослин, які мають вбудовану стійкість до фітофторозу."+
          "\n2.	Забезпечуйте добру дренаж та уникайте надмірного зволоження ґрунту."+
          "\n3.	Уникайте повторного використання заражених насіння або рослинних залишків."+
          "\n4.	Дотримуйтесь правильного повороту культур."+
          "\n5.	Використовуйте фунгіциди або біологічні засоби захисту рослин при необхідності.",
      isImportant: false),

  const Info(id: 13,
      clas: "potatoHealthy",
      description: "Здорова рослина картоплі.",
      infection: "Відсутня",
      symptoms: "🥔Здорова та сильна рослина🥔",
      prevention: "Відсутня",
      isImportant: false),

  const Info(id: 14,
      clas: "tomatoTargetSpot",
      description: "Хвороба Target Spot (цільові плями) - це грибкове захворювання, яке поширене у багатьох культурах, зокрема у буряках, бамії, перці, помідорах та інших рослинах. Плями на листі майже неможливо відрізнити від альтернаріозу, за винятком відсутності інтенсивного жовтіння навколо плями, що є характерним для хвороби ранньої плямистості. При сприятливих умовах на листі можна спостерігати кілька плям, що призводить до висихання листя.",
      infection: "Хвороба сприяє помірним температурам (20-28 ° C) та тривалим періодам зволоження листя (16 годин або більше). Гриб інфікує багато культур, включаючи перець, огірок, декоративні рослини та бур'яни. Гриб може колонізувати бур'яни або інші культури та залишатися життєздатним протягом до двох років. Хворобу передають повітряні конідії/спори. Поштовхи дощу або вітром переносяться частинки ґрунту створюють поранення на плоді для проникнення спор.",
      symptoms: "Спочатку на верхній поверхні старіших листків з'являються невеликі, темно-коричневі або вологі плями, які поступово збільшуються (до 2 см у діаметрі), стаючи круглими з концентричними кільцями. Плями на верхній поверхні листя мають блідо-жовтий колір і є нечіткими.",
      prevention: "Використовуйте безвірусних розсадників.Відповідний розмір міжрослинного простору може допомогти зменшити тривалість зволоження листя. Забезпечуйте гарну гігієну поля (наприклад, видалення і спалювання сильно пошкоджених листя, видалення бур'янів).",
      isImportant: false),
];

List<String> namesUA = [
  "Здоровий томат",
  "Томат. Плямистість бактеріальна чорна",
  "Томат. Листова цвіль",
  "Томат. Септоріоз",
  "Томат. Павутинні кліщі",
  "Томат. Фітофтороз",
  "Томат. Альтернаріоз",
  "Томат. Мозаїка",
  "Томат. Жовта кучерявість листя",
  "Перець. Плямистість бактеріальна чорна",
  "Здоровий перець",
  "Картопля. Альтернаріоз",
  "Картопля. Фітофтороз",
  "Здорова картопля",
  "Томат. Плямистість",
];

